Tutorials/Covolume/Sod/Test1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Right state
defaultFieldValues
(
    volScalarFieldValue T 0.333e+6
    volScalarFieldValue p 0.1e+6
    volVectorFieldValue U ( 0 0 0 )
);

//Left state
regions
(
    boxToCell
    {
        box ( -1 -1 -1 ) ( 0.4 1  1 );
        fieldValues
        (
            volScalarFieldValue T 3.0e+6
            volScalarFieldValue p 100.0e+6
        );
    }
);


// ************************************************************************* //
